---
title: 🌐 Enlaces Seriales
---

# 🌐 Enlaces Seriales

## 📌 ¿Qué es un enlace serial y para qué se usa?

En redes de mayor alcance, los **enlaces seriales** permiten conectar routers a través de tecnologías WAN (Wide Area Network).  
En **Packet Tracer**, podemos simular este tipo de conexiones para entender cómo funciona la comunicación entre redes separadas.  

---

## 🔌 Tipos de conexiones seriales

En Packet Tracer y en redes reales, los **enlaces seriales** requieren un cable especial **DCE/DTE** para conectar los routers.

| **Componente** | **Descripción** |
|---------------|----------------|
| **DCE (Data Communications Equipment)** | Se encarga de generar la señal del reloj y regular la transmisión de datos. |
| **DTE (Data Terminal Equipment)** | Dispositivo terminal que recibe la señal (por ejemplo, un router). |

📌 **IMPORTANTE:** El router que actúe como **DCE** debe configurar una velocidad de reloj (`clock rate`).  

---

### 🛠️ Pasos para agregar el módulo serial:

1️⃣ **Apagar el router** antes de instalar el módulo. En la pestaña **Physical**, haz clic en el botón **Power Off**.  
2️⃣ **Arrastrar y colocar** el módulo **WIC-2T** en una de las ranuras vacías del router.  
3️⃣ **Encender el router** con el botón **Power On**.  
4️⃣ Verificar que el router reconoce la nueva interfaz con el comando:  

```shell
Router# show ip interface brief
```

📌 **Ahora el router tendrá interfaces seriales disponibles para la configuración del enlace WAN.**

---

## 🛠️ Configuración de Enlaces Seriales en Packet Tracer

### 1️⃣ Instalar módulos de interfaz serial en routers

Algunos routers en Packet Tracer **no tienen puertos seriales por defecto**. Para agregarlos:

1️⃣ Apagar el router (**power off** en la pestaña Physical).  
2️⃣ Arrastrar y colocar el módulo **WIC-2T** en la ranura vacía.  
3️⃣ Encender el router (**power on**).  

---

### 2️⃣ Conectar los routers con un cable serial

📌 **Paso 1:** Usar el **cable serial DCE/DTE** para interconectar ambos routers.  
📌 **Paso 2:** Identificar cuál de los routers es **DCE** ejecutando:  

```shell
Router# show controllers serial 0/0/0
```

📌 **Si el router es DCE, deberá configurar el clock rate.**  

---

### 3️⃣ Configurar direcciones IP en los puertos seriales

📌 **Ejemplo de configuración en el primer router (R1):**

```shell
Router(config)# interface Serial0/0/0
Router(config-if)# ip address 10.0.0.1 255.255.255.252
Router(config-if)# no shutdown
Router(config-if)# exit
```

📌 **Ejemplo de configuración en el segundo router (R2):**

```shell
Router(config)# interface Serial0/0/0
Router(config-if)# ip address 10.0.0.2 255.255.255.252
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

### 4️⃣ Configurar el clock rate (solo en el router DCE)

Si el router es **DCE**, debe establecer una velocidad de reloj (`clock rate`) o el enlace **no funcionará**.

```shell
Router(config)# interface Serial0/0/0
Router(config-if)# clock rate 64000
Router(config-if)# exit
```

📌 **Si el router es DTE, NO se configura el clock rate.**  

---

### 5️⃣ Verificar la conectividad con `ping`

Para comprobar que la conexión serial funciona correctamente, ejecutar en **R1**:

```shell
Router# ping 10.0.0.2
```

📌 **Si responde correctamente, significa que la conexión está configurada correctamente.**  

---

## 📝 Resumen

✅ Los enlaces seriales permiten la comunicación entre routers en redes WAN.  
✅ El router DCE debe configurar un `clock rate` para la transmisión de datos.  
✅ Las interfaces seriales deben configurarse con direcciones IP y activarse con `no shutdown`.  
✅ La conectividad se verifica con `ping` y `show controllers serial`.  

