---
title: 🏢 VLANS
---

# 🏢 Configuración de VLANs

## 📌 ¿Qué son las VLANs y por qué son importantes?

Las **VLANs (Virtual Local Area Networks)** permiten segmentar lógicamente una red dentro de un mismo switch, separando el tráfico en grupos específicos sin necesidad de hardware adicional.

### 🔹 Beneficios de las VLANs:

✔ **Mayor seguridad**: Los dispositivos de diferentes VLANs no pueden comunicarse sin un router o switch de capa 3.  
✔ **Optimización del ancho de banda**: Reduce el tráfico de broadcast innecesario.  
✔ **Flexibilidad**: Los dispositivos pueden estar en distintas ubicaciones físicas y seguir en la misma VLAN.  

---

## 🏢 Caso práctico: Empresa con dos plantas

📌 **Escenario:**  
Imaginemos una empresa con dos plantas y la siguiente distribución de departamentos:

- **Planta superior**: Compras y Contabilidad.  
- **Planta inferior**: Ventas y Administración.  
- Cada planta tiene un **switch gestionable**.  
- Queremos que **Compras y Ventas** compartan una subred lógica (**VLAN 10**).  
- Del mismo modo, **Administración y Contabilidad** estarán en **VLAN 20**.  

<br>

En una red sin VLANs, necesitaríamos **switches separados o diferentes rangos de IP** en cada planta.  
📌 **Solución:** Usamos VLANs para segmentar la red de manera eficiente.  

| **VLAN** | **Departamentos**        | **Planta**  |
|----------|--------------------------|-------------|
| 10       | Compras y Ventas         | Superior e Inferior |
| 20       | Administración y Contabilidad | Superior e Inferior |

---

## 🛠️ Configuración de VLANs en un switch gestionable

### 1️⃣ Creación de VLANs

```shell
Switch# configure terminal
Switch(config)# vlan 10
Switch(config-vlan)# name Compras_Ventas
Switch(config-vlan)# exit
Switch(config)# vlan 20
Switch(config-vlan)# name Admin_Contabilidad
Switch(config-vlan)# exit
```

### 2️⃣ Asignar puertos a las VLANs

```shell
Switch(config)# interface FastEthernet 0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# exit

Switch(config)# interface FastEthernet 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch(config-if)# exit
```

### 3️⃣ Configuración de un puerto Trunk

Para permitir que las VLANs funcionen en **múltiples switches**, configuramos un puerto **Trunk**.

```shell
Switch(config)# interface GigabitEthernet 0/1
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk allowed vlan 10,20
Switch(config-if)# exit
```

📌 **Explicación:**  
✔ **Los puertos de acceso (`switchport access vlan X`)** asignan los dispositivos a VLANs específicas.  
✔ **El puerto Trunk (`switchport mode trunk`)** transporta tráfico de ambas VLANs entre switches.  

---

## 🔍 Verificación de la configuración de VLANs

📌 **Mostrar VLANs configuradas en el switch:**  
```shell
Switch# show vlan brief
```

📌 **Mostrar puertos Trunk:**  
```shell
Switch# show interfaces trunk
```

---

## 🛠️ Imagen: Configuración de VLANs en un switch

La siguiente imagen muestra una simulación de VLANS en un switch


<div style="text-align: center;">
    <img src="/images/vlan.png" alt="Simulación de VLANs en un switch" width="600px"
         style="border: 2px solid #007bff; box-shadow: 5px 5px 15px rgba(0, 0, 0, 0.3); border-radius: 10px; 
         transition: transform 0.3s ease-in-out, box-shadow 0.3s ease-in-out;"
         onmouseover="this.style.transform='scale(1.05)'; this.style.boxShadow='8px 8px 20px rgba(0, 0, 0, 0.5)';"
         onmouseout="this.style.transform='scale(1)';">
</div>

---

## 📝 Resumen

✅ **Las VLANs permiten segmentar redes** dentro de un mismo switch.  
✅ **Mejoran la seguridad y el rendimiento**, separando tráfico innecesario.  
✅ **Configuración CLI:** Se crean con `vlan X` y se asignan con `switchport access vlan X`.  
✅ **Los puertos Trunk permiten que varias VLANs se comuniquen entre switches.**  
✅ **Se verifican con `show vlan brief` y `show interfaces trunk`**.  

