---
title: 🛠️ SO Cisco IOS
---

# 🛠️ Sistema Operativo - Cisco IOS

## 📌 Ayuda del Sistema Operativo en Cisco IOS

Cisco IOS proporciona herramientas de **ayuda integrada** dentro de la CLI para facilitar el uso de comandos y descubrir opciones disponibles. Estas funciones permiten navegar de manera eficiente en el sistema.

### 🔹 1. Uso del `?` para listar comandos disponibles

Si en cualquier momento presionamos `?`, el sistema nos mostrará una lista de comandos disponibles en el nivel actual.

```shell
Switch# ?
configure    Configure system settings
enable       Turn on privileged commands
show         Show running system information
```

### 🔹 2. Autocompletado de comandos con `Tab`

Si escribimos una parte de un comando y presionamos la tecla `Tab`, el sistema lo completará automáticamente.

```shell
Switch# conf<Tab>
Switch# configure
```

### 🔹 3. Obtener ayuda sobre un comando específico

Podemos escribir un comando seguido de `?` para ver las opciones disponibles.

```shell
Switch# show ?
clock        Display the system clock
interfaces   Display interface status
version      Display IOS version
```

### 🔹 4. Revisar el historial de comandos

Cisco IOS mantiene un historial de los últimos comandos ejecutados. Para verlos, usamos:

```shell
Switch# show history
```

También podemos repetir comandos anteriores con la flecha **↑** del teclado.

---

## ⏰ Configuración del Reloj en un Switch

Configurar la hora correctamente en un switch es crucial para la gestión de **logs, eventos de seguridad y sincronización en red**.

### 🔹 ¿Por qué es importante configurar el reloj?
✔ **Registro de eventos y logs (`show clock`, `show logging`)** → Los switches y routers registran eventos con marca de tiempo.  
✔ **Protocolos de seguridad** → SSH, RADIUS y certificados digitales dependen de la hora correcta.  
✔ **Sincronización con NTP (Network Time Protocol)** → Asegura que todos los dispositivos de la red tengan la misma referencia temporal.

### 🔹 Comandos para configurar el reloj

✔ **Ver la hora actual del switch:**  
```shell
Switch# show clock
```

✔ **Configurar la hora manualmente:**  
```shell
Switch# clock set 15:30:00 21 Feb 2025
```

✔ **Configurar sincronización con un servidor NTP:**  
```shell
Switch# configure terminal
Switch(config)# ntp server 192.168.1.1
Switch(config)# exit
Switch# write memory
```

---

## 📝 Resumen

✅ Cisco IOS tiene herramientas de ayuda como `?`, `Tab` y `show history` para facilitar el uso de comandos.  
✅ La configuración del reloj es esencial para **logs, seguridad y sincronización en la red**.  
✅ Se puede ajustar manualmente (`clock set`) o configurar con un servidor NTP (`ntp server`).  
