---
title: ğŸŒ Enlaces Seriales
---

# ğŸŒ Enlaces Seriales

## ğŸ“Œ Â¿QuÃ© es un enlace serial y para quÃ© se usa?

En redes de mayor alcance, los **enlaces seriales** permiten conectar routers a travÃ©s de tecnologÃ­as WAN (Wide Area Network).  
En **Packet Tracer**, podemos simular este tipo de conexiones para entender cÃ³mo funciona la comunicaciÃ³n entre redes separadas.  

---

## ğŸ”Œ Tipos de conexiones seriales

En Packet Tracer y en redes reales, los **enlaces seriales** requieren un cable especial **DCE/DTE** para conectar los routers.

| **Componente** | **DescripciÃ³n** |
|---------------|----------------|
| **DCE (Data Communications Equipment)** | Se encarga de generar la seÃ±al del reloj y regular la transmisiÃ³n de datos. |
| **DTE (Data Terminal Equipment)** | Dispositivo terminal que recibe la seÃ±al (por ejemplo, un router). |

ğŸ“Œ **IMPORTANTE:** El router que actÃºe como **DCE** debe configurar una velocidad de reloj (`clock rate`).  

---

### ğŸ› ï¸ Pasos para agregar el mÃ³dulo serial:

1ï¸âƒ£ **Apagar el router** antes de instalar el mÃ³dulo. En la pestaÃ±a **Physical**, haz clic en el botÃ³n **Power Off**.  
2ï¸âƒ£ **Arrastrar y colocar** el mÃ³dulo **WIC-2T** en una de las ranuras vacÃ­as del router.  
3ï¸âƒ£ **Encender el router** con el botÃ³n **Power On**.  
4ï¸âƒ£ Verificar que el router reconoce la nueva interfaz con el comando:  

```shell
Router# show ip interface brief
```

ğŸ“Œ **Ahora el router tendrÃ¡ interfaces seriales disponibles para la configuraciÃ³n del enlace WAN.**

---

## ğŸ› ï¸ ConfiguraciÃ³n de Enlaces Seriales en Packet Tracer

### 1ï¸âƒ£ Instalar mÃ³dulos de interfaz serial en routers

Algunos routers en Packet Tracer **no tienen puertos seriales por defecto**. Para agregarlos:

1ï¸âƒ£ Apagar el router (**power off** en la pestaÃ±a Physical).  
2ï¸âƒ£ Arrastrar y colocar el mÃ³dulo **WIC-2T** en la ranura vacÃ­a.  
3ï¸âƒ£ Encender el router (**power on**).  

---

### 2ï¸âƒ£ Conectar los routers con un cable serial

ğŸ“Œ **Paso 1:** Usar el **cable serial DCE/DTE** para interconectar ambos routers.  
ğŸ“Œ **Paso 2:** Identificar cuÃ¡l de los routers es **DCE** ejecutando:  

```shell
Router# show controllers serial 0/0/0
```

ğŸ“Œ **Si el router es DCE, deberÃ¡ configurar el clock rate.**  

---

### 3ï¸âƒ£ Configurar direcciones IP en los puertos seriales

ğŸ“Œ **Ejemplo de configuraciÃ³n en el primer router (R1):**

```shell
Router(config)# interface Serial0/0/0
Router(config-if)# ip address 10.0.0.1 255.255.255.252
Router(config-if)# no shutdown
Router(config-if)# exit
```

ğŸ“Œ **Ejemplo de configuraciÃ³n en el segundo router (R2):**

```shell
Router(config)# interface Serial0/0/0
Router(config-if)# ip address 10.0.0.2 255.255.255.252
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

### 4ï¸âƒ£ Configurar el clock rate (solo en el router DCE)

Si el router es **DCE**, debe establecer una velocidad de reloj (`clock rate`) o el enlace **no funcionarÃ¡**.

```shell
Router(config)# interface Serial0/0/0
Router(config-if)# clock rate 64000
Router(config-if)# exit
```

ğŸ“Œ **Si el router es DTE, NO se configura el clock rate.**  

---

### 5ï¸âƒ£ Verificar la conectividad con `ping`

Para comprobar que la conexiÃ³n serial funciona correctamente, ejecutar en **R1**:

```shell
Router# ping 10.0.0.2
```

ğŸ“Œ **Si responde correctamente, significa que la conexiÃ³n estÃ¡ configurada correctamente.**  

---

## ğŸ“ Resumen

âœ… Los enlaces seriales permiten la comunicaciÃ³n entre routers en redes WAN.  
âœ… El router DCE debe configurar un `clock rate` para la transmisiÃ³n de datos.  
âœ… Las interfaces seriales deben configurarse con direcciones IP y activarse con `no shutdown`.  
âœ… La conectividad se verifica con `ping` y `show controllers serial`.  

