---
title: ğŸ› ï¸ SO Cisco IOS
---

# ğŸ› ï¸ Sistema Operativo - Cisco IOS

## ğŸ“Œ Ayuda del Sistema Operativo en Cisco IOS

Cisco IOS proporciona herramientas de **ayuda integrada** dentro de la CLI para facilitar el uso de comandos y descubrir opciones disponibles. Estas funciones permiten navegar de manera eficiente en el sistema.

### ğŸ”¹ 1. Uso del `?` para listar comandos disponibles

Si en cualquier momento presionamos `?`, el sistema nos mostrarÃ¡ una lista de comandos disponibles en el nivel actual.

```shell
Switch# ?
configure    Configure system settings
enable       Turn on privileged commands
show         Show running system information
```

### ğŸ”¹ 2. Autocompletado de comandos con `Tab`

Si escribimos una parte de un comando y presionamos la tecla `Tab`, el sistema lo completarÃ¡ automÃ¡ticamente.

```shell
Switch# conf<Tab>
Switch# configure
```

### ğŸ”¹ 3. Obtener ayuda sobre un comando especÃ­fico

Podemos escribir un comando seguido de `?` para ver las opciones disponibles.

```shell
Switch# show ?
clock        Display the system clock
interfaces   Display interface status
version      Display IOS version
```

### ğŸ”¹ 4. Revisar el historial de comandos

Cisco IOS mantiene un historial de los Ãºltimos comandos ejecutados. Para verlos, usamos:

```shell
Switch# show history
```

TambiÃ©n podemos repetir comandos anteriores con la flecha **â†‘** del teclado.

---

## â° ConfiguraciÃ³n del Reloj en un Switch

Configurar la hora correctamente en un switch es crucial para la gestiÃ³n de **logs, eventos de seguridad y sincronizaciÃ³n en red**.

### ğŸ”¹ Â¿Por quÃ© es importante configurar el reloj?
âœ” **Registro de eventos y logs (`show clock`, `show logging`)** â†’ Los switches y routers registran eventos con marca de tiempo.  
âœ” **Protocolos de seguridad** â†’ SSH, RADIUS y certificados digitales dependen de la hora correcta.  
âœ” **SincronizaciÃ³n con NTP (Network Time Protocol)** â†’ Asegura que todos los dispositivos de la red tengan la misma referencia temporal.

### ğŸ”¹ Comandos para configurar el reloj

âœ” **Ver la hora actual del switch:**  
```shell
Switch# show clock
```

âœ” **Configurar la hora manualmente:**  
```shell
Switch# clock set 15:30:00 21 Feb 2025
```

âœ” **Configurar sincronizaciÃ³n con un servidor NTP:**  
```shell
Switch# configure terminal
Switch(config)# ntp server 192.168.1.1
Switch(config)# exit
Switch# write memory
```

---

## ğŸ“ Resumen

âœ… Cisco IOS tiene herramientas de ayuda como `?`, `Tab` y `show history` para facilitar el uso de comandos.  
âœ… La configuraciÃ³n del reloj es esencial para **logs, seguridad y sincronizaciÃ³n en la red**.  
âœ… Se puede ajustar manualmente (`clock set`) o configurar con un servidor NTP (`ntp server`).  
